<?php
get_header();

$school_id = get_field('program_school');
$school_name = get_the_title($school_id);
$school_name_en = get_field('name_en', $school_id);
$school_code = get_field('school_code', $school_id);
$school_color = get_field('school_color', $school_id);
if ($school_color) {
    echo '<style> .site-main { --s-color-1: ' . $school_color . ' }</style>';
}



$school_link = get_permalink($school_id);
$school_slug = get_post_field('post_name', $school_id);
$program_id = get_the_ID();
$program_slug = get_post_field('post_name', get_post());

function lorem_table()
{
    echo '';
}

?>

<main id="main" class="site-main single-main -wide">

    <div class="program-school alignfull _h">
        <div class="s-container">
            <a href="<?php echo $school_link; ?>">
                <b><?php echo $school_code; ?></b>
                <span><?php echo $school_name; ?></span>
                <span><?php echo $school_name_en; ?></span>
            </a>
        </div>
    </div>
    <?php

    // $program_arg = array (
    //     'post_type' => 'program',
    //     'posts_per_page' => -1
    // );
    // $program_query = new WP_Query( $program_arg );
    // // loop $program_query
    // while($program_query->have_posts()   ) {
    //     $program_query->the_post();
    //     if( get_field('director_video') ) {
    //         echo '<a href="'. get_permalink() .'">';
    //         echo get_field('director_video')  .'</a>'.'</br>';
    //     }
    // }
    // wp_reset_postdata();

    ?>
    <div class="program-intro">
        <div class="program-name-en _h">
            <?php if (get_field('program_code')) {
                echo '<div class="program-code">' . get_field('program_code') . '</div>';
            } ?>
            <span><?php echo get_field('program_en'); ?></span>
        </div>
        <?php the_title('<h1 class="program-name">', '</h1>'); ?>
        <div class="s-flex flex-warp justify-between">
            <div class="col">
                <div class="s-flex">
                    <div class="program-type _h">
                        <?php echo acf_field_object('program_type'); ?>
                    </div>
                    <div class="program-location _h"><?php echo get_field('location'); ?></div>
                </div>
            </div>
            <?php
            if (function_exists('seed_social')) {
                echo '<div class="entry-social" style="margin-left:auto;">';
                seed_social();
                echo '</div>';
            }
            ?>
        </div>
        <div class="_space"></div>
        <div class="s-grid -d2 items-center mb-0">
            <blockquote class="wp-block-quote program-quote has-text-align-center _h">
                <i>
                    <?php
                    if (get_field('program_quote')) {
                        echo get_field('program_quote');
                    } else {
                        echo '';
                    }
                    ?>
                </i>
            </blockquote>
            <div class="program-description">
                <?php
                if (get_field('program_description')) {
                    echo get_field('program_description');
                } else {
                    echo '';
                }
                ?>
                <a href="/admission?facid=<?php echo $school_id; ?>&progid=<?php echo $program_id; ?>" class="s-flex btn btn-danger">สมัครเรียน <?php seed_icon('arrow-right-circle'); ?></a>
            </div>
        </div>
    </div>
    <div class="s-sec alignfull">
        <div class="program-cover">
            <?php
            $program_gallery = get_field('program_gallery');
            if ($program_gallery) {
                foreach ($program_gallery as $image) {
                    echo '<div class="item"><img src="' . $image . '" alt="" /></div>';
                }
            } else {
                echo '<div class="item"><img src="' . get_stylesheet_directory_uri() . '/assets/img/program-cover.webp" alt="" /></div>';
            }
            ?>
        </div>
        <div class="info-box">
            <div class="box">
                <div class="icon">
                    <svg width="44" height="44" viewBox="0 0 44 44" fill="none" xmlns="http://www.w3.org/2000/svg">
                        <path d="M22.0001 5.50903C21.0546 5.50903 20.1093 5.71564 19.225 6.1285L2.62655 13.879C2.38942 13.9897 2.1888 14.1657 2.04824 14.3864C1.90767 14.6071 1.83301 14.8634 1.83301 15.1251C1.83301 15.3868 1.90767 15.643 2.04824 15.8637C2.1888 16.0845 2.38942 16.2605 2.62655 16.3712L9.19182 19.4363C9.17445 19.5259 9.16605 19.6171 9.16675 19.7084V31.6519C9.16675 33.5944 10.2773 35.4031 12.0707 36.2227C15.3626 37.7273 18.6192 38.5107 21.9983 38.5001C22.0007 38.5001 22.0031 38.5001 22.0055 38.5001C22.0551 38.5004 22.1047 38.498 22.1541 38.4929C24.5992 38.467 27.1123 38.0279 29.5465 37.1967C28.914 36.5248 28.5141 35.6414 28.4454 34.6633C26.3105 35.3682 24.1186 35.7427 21.9947 35.7501C19.0386 35.7603 16.218 35.0943 13.2148 33.7216C12.4287 33.3624 11.9167 32.5456 11.9167 31.6519V20.7092L19.225 24.1217C20.9936 24.9474 23.0066 24.9474 24.7751 24.1217L31.1667 21.1371V32.5453C30.7834 32.8344 30.5006 33.2365 30.3581 33.6949C30.2156 34.1533 30.2207 34.6449 30.3726 35.1003C30.5246 35.5557 30.8157 35.9519 31.2049 36.233C31.5941 36.514 32.0617 36.6657 32.5417 36.6667C33.0223 36.6662 33.4905 36.5147 33.8802 36.2336C34.2699 35.9524 34.5613 35.5559 34.7133 35.1C34.8653 34.6442 34.8702 34.1521 34.7273 33.6933C34.5843 33.2346 34.3008 32.8323 33.9167 32.5435V20.0164C33.9698 19.6732 33.8912 19.3227 33.6965 19.0352C33.6752 19.0033 33.6525 18.9722 33.6285 18.9421C33.45 18.7105 33.2023 18.5418 32.9213 18.4605L32.9177 18.4587L23.0367 13.8772C22.8289 13.7771 22.5992 13.731 22.3689 13.7429C22.0663 13.7585 21.7773 13.8736 21.5469 14.0704C21.3164 14.2671 21.1574 14.5345 21.0945 14.8309C21.0316 15.1273 21.0684 15.4362 21.1992 15.7095C21.3299 15.9829 21.5473 16.2054 21.8175 16.3425C21.8381 16.3532 21.859 16.3633 21.8801 16.373L28.3988 19.3951L23.6114 21.6313C22.5292 22.1365 21.471 22.1365 20.3888 21.6313L6.45793 15.1251L20.3888 8.62069C21.471 8.1154 22.5292 8.1154 23.6114 8.62069L37.5422 15.1251L33.8272 16.8599L33.8917 16.8904C33.8917 16.8904 33.8952 16.8903 33.8971 16.8922C33.8989 16.8922 33.9006 16.894 33.9006 16.894C33.9025 16.894 33.905 16.8957 33.9078 16.8975C34.6274 17.2358 35.1638 17.8074 35.4672 18.4802C35.547 18.659 35.6102 18.8463 35.657 19.0388L41.3736 16.3694C41.5398 16.2923 41.689 16.1827 41.8123 16.0471L41.814 16.0435C41.9281 15.9161 42.0173 15.7686 42.0772 15.6085C42.0806 15.5994 42.0847 15.5908 42.088 15.5816C42.1454 15.4185 42.1715 15.246 42.165 15.0732C42.1649 15.0707 42.1633 15.0684 42.1632 15.066C42.1601 14.9786 42.1487 14.8917 42.1291 14.8064C42.1284 14.8033 42.1263 14.8005 42.1256 14.7974C42.1055 14.7157 42.0779 14.636 42.0432 14.5593C42.0408 14.5541 42.0403 14.5485 42.0378 14.5432C42.0352 14.5375 42.0316 14.5327 42.0289 14.5271C41.9913 14.4484 41.9464 14.3735 41.8946 14.3033C41.8926 14.3006 41.8895 14.2989 41.8874 14.2961C41.8401 14.2333 41.7873 14.1746 41.7299 14.1207C41.7162 14.1079 41.7029 14.0953 41.6887 14.0831C41.6363 14.0384 41.5807 13.9977 41.5222 13.9613C41.5058 13.951 41.4889 13.9423 41.4721 13.9327C41.44 13.9135 41.4072 13.8955 41.3736 13.879L24.7751 6.1285C23.8909 5.71564 22.9456 5.50903 22.0001 5.50903Z" fill="#2D2A4A" />
                    </svg>
                </div>
                <div class="info">
                    <div class="box-title">
                        <?php echo acf_field_object('education_level'); ?>
                    </div>
                    <div class="box-content">
                        <?php
                        if ($school_name) {
                            echo $school_name;
                        } else {
                            echo '';
                        }
                        ?>
                    </div>
                </div>
            </div>
            <div class="box">
                <div class="icon">
                    <svg width="44" height="44" viewBox="0 0 44 44" fill="none" xmlns="http://www.w3.org/2000/svg">
                        <path d="M11.4583 5.5C8.18406 5.5 5.5 8.18406 5.5 11.4583V32.5417C5.5 35.8159 8.18406 38.5 11.4583 38.5H32.5417C35.8159 38.5 38.5 35.8159 38.5 32.5417V11.4583C38.5 8.18406 35.8159 5.5 32.5417 5.5H11.4583ZM11.4583 8.25H32.5417C34.3292 8.25 35.75 9.67078 35.75 11.4583V12.8333H8.25V11.4583C8.25 9.67078 9.67078 8.25 11.4583 8.25ZM8.25 15.5833H35.75V32.5417C35.75 34.3292 34.3292 35.75 32.5417 35.75H11.4583C9.67078 35.75 8.25 34.3292 8.25 32.5417V15.5833ZM14.2083 19.25C13.6005 19.25 13.0177 19.4914 12.5879 19.9212C12.1581 20.351 11.9167 20.9339 11.9167 21.5417C11.9167 22.1495 12.1581 22.7323 12.5879 23.1621C13.0177 23.5919 13.6005 23.8333 14.2083 23.8333C14.8161 23.8333 15.399 23.5919 15.8288 23.1621C16.2586 22.7323 16.5 22.1495 16.5 21.5417C16.5 20.9339 16.2586 20.351 15.8288 19.9212C15.399 19.4914 14.8161 19.25 14.2083 19.25ZM22 19.25C21.3922 19.25 20.8093 19.4914 20.3795 19.9212C19.9498 20.351 19.7083 20.9339 19.7083 21.5417C19.7083 22.1495 19.9498 22.7323 20.3795 23.1621C20.8093 23.5919 21.3922 23.8333 22 23.8333C22.6078 23.8333 23.1907 23.5919 23.6205 23.1621C24.0502 22.7323 24.2917 22.1495 24.2917 21.5417C24.2917 20.9339 24.0502 20.351 23.6205 19.9212C23.1907 19.4914 22.6078 19.25 22 19.25ZM29.7917 19.25C29.1839 19.25 28.601 19.4914 28.1712 19.9212C27.7414 20.351 27.5 20.9339 27.5 21.5417C27.5 22.1495 27.7414 22.7323 28.1712 23.1621C28.601 23.5919 29.1839 23.8333 29.7917 23.8333C30.3995 23.8333 30.9824 23.5919 31.4121 23.1621C31.8419 22.7323 32.0833 22.1495 32.0833 21.5417C32.0833 20.9339 31.8419 20.351 31.4121 19.9212C30.9824 19.4914 30.3995 19.25 29.7917 19.25ZM14.2083 27.5C13.6005 27.5 13.0177 27.7414 12.5879 28.1712C12.1581 28.601 11.9167 29.1839 11.9167 29.7917C11.9167 30.3995 12.1581 30.9824 12.5879 31.4121C13.0177 31.8419 13.6005 32.0833 14.2083 32.0833C14.8161 32.0833 15.399 31.8419 15.8288 31.4121C16.2586 30.9824 16.5 30.3995 16.5 29.7917C16.5 29.1839 16.2586 28.601 15.8288 28.1712C15.399 27.7414 14.8161 27.5 14.2083 27.5ZM22 27.5C21.3922 27.5 20.8093 27.7414 20.3795 28.1712C19.9498 28.601 19.7083 29.1839 19.7083 29.7917C19.7083 30.3995 19.9498 30.9824 20.3795 31.4121C20.8093 31.8419 21.3922 32.0833 22 32.0833C22.6078 32.0833 23.1907 31.8419 23.6205 31.4121C24.0502 30.9824 24.2917 30.3995 24.2917 29.7917C24.2917 29.1839 24.0502 28.601 23.6205 28.1712C23.1907 27.7414 22.6078 27.5 22 27.5Z" fill="#2D2A4A" />
                    </svg>
                </div>
                <div class="info">
                    <div class="box-title">
                        <?php
                        if (get_field('program_type') == 'not_time') {
                            echo  acf_field_object('language');
                        } else {
                            echo acf_field_object('program_type') . ' ' . acf_field_object('language');
                        }
                        ?>
                    </div>
                    <div class="box-content">
                        <?php
                        if (get_field('program_type') == 'not_time') {
                            echo get_field('program_type_not_time');
                        } else {
                            echo acf_field_object('program_type');
                        }
                        ?>
                    </div>
                </div>
            </div>
            <div class="box">
                <div class="icon">
                    <svg width="44" height="44" viewBox="0 0 44 44" fill="none" xmlns="http://www.w3.org/2000/svg">
                        <path d="M22 4.58325C15.9412 4.58325 11 9.5244 11 15.5833C11 18.2939 12.6075 21.3089 14.4304 24.3059C16.2532 27.3029 18.3783 30.155 19.6922 31.8487C20.8402 33.3279 23.1598 33.3279 24.3078 31.8487C25.6217 30.155 27.7468 27.3029 29.5697 24.3059C31.3926 21.3089 33 18.2939 33 15.5833C33 9.5244 28.0589 4.58325 22 4.58325ZM22 7.33325C26.5727 7.33325 30.25 11.0106 30.25 15.5833C30.25 17.004 28.9504 20.0305 27.2189 22.8772C25.4874 25.7239 23.4109 28.5183 22.1343 30.164C22.043 30.2816 21.9571 30.2816 21.8657 30.164C20.5891 28.5183 18.5126 25.7239 16.7811 22.8772C15.0496 20.0305 13.75 17.004 13.75 15.5833C13.75 11.0106 17.4274 7.33325 22 7.33325ZM22 12.8333C21.2707 12.8333 20.5712 13.123 20.0555 13.6387C19.5397 14.1544 19.25 14.8539 19.25 15.5833C19.25 16.3126 19.5397 17.0121 20.0555 17.5278C20.5712 18.0435 21.2707 18.3333 22 18.3333C22.7294 18.3333 23.4288 18.0435 23.9446 17.5278C24.4603 17.0121 24.75 16.3126 24.75 15.5833C24.75 14.8539 24.4603 14.1544 23.9446 13.6387C23.4288 13.123 22.7294 12.8333 22 12.8333ZM10.7476 27.4999C9.48074 27.4999 8.32829 28.248 7.81495 29.4049L5.77931 33.9882C5.33656 34.9846 5.42522 36.1251 6.01922 37.039C6.61413 37.9538 7.62022 38.4999 8.71014 38.4999H35.2881C36.378 38.4999 37.385 37.9538 37.979 37.039C38.5739 36.1251 38.6635 34.9855 38.2207 33.9882L36.1851 29.4049C35.6708 28.248 34.5202 27.4999 33.2525 27.4999H30.2679C29.684 28.3845 29.0504 29.3003 28.3665 30.2499H33.2525C33.433 30.2499 33.5981 30.3561 33.6714 30.5221L35.707 35.1054C35.795 35.3034 35.7244 35.4643 35.673 35.5422C35.6217 35.6202 35.5062 35.7499 35.2899 35.7499H8.71014C8.4938 35.7499 8.37562 35.6184 8.32521 35.5404C8.27479 35.4625 8.20411 35.3034 8.29119 35.1054L10.3286 30.5221C10.402 30.3571 10.567 30.2499 10.7476 30.2499H15.6317C14.9469 29.3003 14.3151 28.3845 13.7321 27.4999H10.7476Z" fill="#2D2A4A" />
                    </svg>
                </div>
                <div class="info">
                    <div class="box-title"><?php echo get_field('location'); ?></div>
                    <div class="box-content"><?php echo $school_name; ?> นิด้า</div>
                </div>
            </div>
            <div class="box">
                <div class="icon">
                    <svg width="44" height="44" viewBox="0 0 44 44" fill="none" xmlns="http://www.w3.org/2000/svg">
                        <path d="M8.70841 7.33325C5.94029 7.33325 3.66675 9.60679 3.66675 12.3749V31.6249C3.66675 34.393 5.94029 36.6666 8.70841 36.6666H35.2917C38.0599 36.6666 40.3334 34.393 40.3334 31.6249V12.3749C40.3334 9.60679 38.0599 7.33325 35.2917 7.33325H8.70841ZM8.70841 10.0833H35.2917C36.5735 10.0833 37.5834 11.0932 37.5834 12.3749V31.6249C37.5834 32.9066 36.5735 33.9166 35.2917 33.9166H8.70841C7.42671 33.9166 6.41675 32.9066 6.41675 31.6249V12.3749C6.41675 11.0932 7.42671 10.0833 8.70841 10.0833ZM11.4584 15.5833C11.2762 15.5807 11.0953 15.6143 10.9262 15.6823C10.7571 15.7502 10.6033 15.8511 10.4735 15.979C10.3437 16.107 10.2407 16.2594 10.1704 16.4275C10.1 16.5956 10.0638 16.776 10.0638 16.9583C10.0638 17.1405 10.1 17.3209 10.1704 17.489C10.2407 17.6571 10.3437 17.8095 10.4735 17.9375C10.6033 18.0654 10.7571 18.1663 10.9262 18.2342C11.0953 18.3022 11.2762 18.3358 11.4584 18.3333H25.2084C25.3906 18.3358 25.5715 18.3022 25.7406 18.2342C25.9097 18.1663 26.0636 18.0654 26.1933 17.9375C26.3231 17.8095 26.4261 17.6571 26.4965 17.489C26.5668 17.3209 26.603 17.1405 26.603 16.9583C26.603 16.776 26.5668 16.5956 26.4965 16.4275C26.4261 16.2594 26.3231 16.107 26.1933 15.979C26.0636 15.8511 25.9097 15.7502 25.7406 15.6823C25.5715 15.6143 25.3906 15.5807 25.2084 15.5833H11.4584ZM30.7084 15.5833C30.5262 15.5807 30.3453 15.6143 30.1762 15.6823C30.0071 15.7502 29.8533 15.8511 29.7235 15.979C29.5937 16.107 29.4907 16.2594 29.4204 16.4275C29.35 16.5956 29.3138 16.776 29.3138 16.9583C29.3138 17.1405 29.35 17.3209 29.4204 17.489C29.4907 17.6571 29.5937 17.8095 29.7235 17.9375C29.8533 18.0654 30.0071 18.1663 30.1762 18.2342C30.3453 18.3022 30.5262 18.3358 30.7084 18.3333H32.5417C32.724 18.3358 32.9049 18.3022 33.0739 18.2342C33.243 18.1663 33.3969 18.0654 33.5267 17.9375C33.6564 17.8095 33.7595 17.6571 33.8298 17.489C33.9001 17.3209 33.9363 17.1405 33.9363 16.9583C33.9363 16.776 33.9001 16.5956 33.8298 16.4275C33.7595 16.2594 33.6564 16.107 33.5267 15.979C33.3969 15.8511 33.243 15.7502 33.0739 15.6823C32.9049 15.6143 32.724 15.5807 32.5417 15.5833H30.7084ZM11.4584 21.0833C11.2762 21.0807 11.0953 21.1143 10.9262 21.1823C10.7571 21.2502 10.6033 21.3511 10.4735 21.479C10.3437 21.607 10.2407 21.7594 10.1704 21.9275C10.1 22.0956 10.0638 22.276 10.0638 22.4583C10.0638 22.6405 10.1 22.8209 10.1704 22.989C10.2407 23.1571 10.3437 23.3095 10.4735 23.4375C10.6033 23.5654 10.7571 23.6663 10.9262 23.7342C11.0953 23.8022 11.2762 23.8358 11.4584 23.8333H25.2084C25.3906 23.8358 25.5715 23.8022 25.7406 23.7342C25.9097 23.6663 26.0636 23.5654 26.1933 23.4375C26.3231 23.3095 26.4261 23.1571 26.4965 22.989C26.5668 22.8209 26.603 22.6405 26.603 22.4583C26.603 22.276 26.5668 22.0956 26.4965 21.9275C26.4261 21.7594 26.3231 21.607 26.1933 21.479C26.0636 21.3511 25.9097 21.2502 25.7406 21.1823C25.5715 21.1143 25.3906 21.0807 25.2084 21.0833H11.4584ZM30.7084 21.0833C30.5262 21.0807 30.3453 21.1143 30.1762 21.1823C30.0071 21.2502 29.8533 21.3511 29.7235 21.479C29.5937 21.607 29.4907 21.7594 29.4204 21.9275C29.35 22.0956 29.3138 22.276 29.3138 22.4583C29.3138 22.6405 29.35 22.8209 29.4204 22.989C29.4907 23.1571 29.5937 23.3095 29.7235 23.4375C29.8533 23.5654 30.0071 23.6663 30.1762 23.7342C30.3453 23.8022 30.5262 23.8358 30.7084 23.8333H32.5417C32.724 23.8358 32.9049 23.8022 33.0739 23.7342C33.243 23.6663 33.3969 23.5654 33.5267 23.4375C33.6564 23.3095 33.7595 23.1571 33.8298 22.989C33.9001 22.8209 33.9363 22.6405 33.9363 22.4583C33.9363 22.276 33.9001 22.0956 33.8298 21.9275C33.7595 21.7594 33.6564 21.607 33.5267 21.479C33.3969 21.3511 33.243 21.2502 33.0739 21.1823C32.9049 21.1143 32.724 21.0807 32.5417 21.0833H30.7084ZM30.7084 26.5833C30.5262 26.5807 30.3453 26.6143 30.1762 26.6823C30.0071 26.7502 29.8533 26.8511 29.7235 26.979C29.5937 27.107 29.4907 27.2594 29.4204 27.4275C29.35 27.5956 29.3138 27.776 29.3138 27.9583C29.3138 28.1405 29.35 28.3209 29.4204 28.489C29.4907 28.6571 29.5937 28.8095 29.7235 28.9375C29.8533 29.0654 30.0071 29.1663 30.1762 29.2342C30.3453 29.3022 30.5262 29.3358 30.7084 29.3333H32.5417C32.724 29.3358 32.9049 29.3022 33.0739 29.2342C33.243 29.1663 33.3969 29.0654 33.5267 28.9375C33.6564 28.8095 33.7595 28.6571 33.8298 28.489C33.9001 28.3209 33.9363 28.1405 33.9363 27.9583C33.9363 27.776 33.9001 27.5956 33.8298 27.4275C33.7595 27.2594 33.6564 27.107 33.5267 26.979C33.3969 26.8511 33.243 26.7502 33.0739 26.6823C32.9049 26.6143 32.724 26.5807 32.5417 26.5833H30.7084Z" fill="#2D2A4A" />
                    </svg>
                </div>
                <div class="info">
                    <div class="box-title">
                        <?php
                        if (get_field('credit')) {
                            echo get_field('credit');
                        } else {
                            echo '0';
                        }
                        ?>
                        หน่วยกิต
                    </div>
                    <div class="box-content"><?php echo get_field('period') ?></div>
                </div>
            </div>
            <div class="box">
                <div class="icon">
                    <svg width="44" height="44" viewBox="0 0 44 44" fill="none" xmlns="http://www.w3.org/2000/svg">
                        <path d="M8.70841 7.33325C5.94029 7.33325 3.66675 9.60679 3.66675 12.3749V17.8749V23.3749V31.6249C3.66675 34.393 5.94029 36.6666 8.70841 36.6666H35.2917C38.0599 36.6666 40.3334 34.393 40.3334 31.6249V23.3749V17.8749V12.3749C40.3334 9.60679 38.0599 7.33325 35.2917 7.33325H8.70841ZM8.70841 10.0833H35.2917C36.5735 10.0833 37.5834 11.0932 37.5834 12.3749V13.3954C36.8938 13.0392 36.116 12.8333 35.2917 12.8333H8.70841C7.88415 12.8333 7.10634 13.0392 6.41675 13.3954V12.3749C6.41675 11.0932 7.42671 10.0833 8.70841 10.0833ZM8.70841 15.5833H35.2917C36.5735 15.5833 37.5834 16.5932 37.5834 17.8749V18.8954C36.8938 18.5392 36.116 18.3333 35.2917 18.3333H27.6666C26.2388 18.3333 25.0376 19.3077 24.6086 20.5855C24.2432 21.6708 23.2247 22.4583 22.0001 22.4583C20.7754 22.4583 19.7579 21.6702 19.3933 20.5855C18.9635 19.3098 17.7631 18.3333 16.3354 18.3333H8.70841C7.88415 18.3333 7.10634 18.5392 6.41675 18.8954V17.8749C6.41675 16.5932 7.42671 15.5833 8.70841 15.5833ZM8.70841 21.0833H16.3354C16.5319 21.0833 16.6975 21.1985 16.7865 21.4628C17.5206 23.6443 19.5898 25.2083 22.0001 25.2083C24.4109 25.2083 26.4808 23.6445 27.2154 21.4628V21.461C27.3034 21.1989 27.47 21.0833 27.6666 21.0833H35.2917C36.5735 21.0833 37.5834 22.0932 37.5834 23.3749V31.6249C37.5834 32.9066 36.5735 33.9166 35.2917 33.9166H8.70841C7.42671 33.9166 6.41675 32.9066 6.41675 31.6249V23.3749C6.41675 22.0932 7.42671 21.0833 8.70841 21.0833Z" fill="black" />
                    </svg>
                </div>
                <div class="info">
                    <div class="box-title">
                        <?php
                        if (get_field('program_fee')) {
                            echo number_format(get_field('program_fee'));
                        } else {
                            echo '0';
                        }
                        ?> บาท</div>
                    <div class="box-content">ค่าใช้จ่ายตลอดหลักสูตร </div>
                </div>
            </div>
            <div class="box">
                <div class="icon">
                    <svg width="44" height="44" viewBox="0 0 44 44" fill="none" xmlns="http://www.w3.org/2000/svg">
                        <path d="M11.4583 3.66675C9.18492 3.66675 7.33325 5.51841 7.33325 7.79175V36.2084C7.33325 38.4817 9.18492 40.3334 11.4583 40.3334H32.5416C34.8149 40.3334 36.6666 38.4817 36.6666 36.2084V26.7571L33.9166 29.5071V36.2084C33.9166 36.9692 33.3024 37.5834 32.5416 37.5834H11.4583C10.6974 37.5834 10.0833 36.9692 10.0833 36.2084V7.79175C10.0833 7.03091 10.6974 6.41675 11.4583 6.41675H21.9999V14.2084C21.9999 16.4817 23.8516 18.3334 26.1249 18.3334H28.2429L30.9929 15.5834H26.1249C25.3641 15.5834 24.7499 14.9692 24.7499 14.2084V8.36108L31.4871 15.0982L32.8352 13.7411C33.0369 13.5395 33.2472 13.3565 33.4672 13.1915L24.3471 4.06958C24.0996 3.82208 23.7599 3.66675 23.3749 3.66675H11.4583ZM40.2974 12.8155C39.8211 12.8297 39.3691 13.0288 39.037 13.3705L38.4301 13.9775C37.8517 13.7871 37.2494 13.719 36.6594 13.793C35.7219 13.9106 34.8242 14.3428 34.135 15.032C34.1344 15.032 34.1338 15.032 34.1332 15.032L25.364 23.803C24.9937 24.1733 24.7195 24.6274 24.5655 25.1278C24.5655 25.1284 24.5655 25.129 24.5655 25.1296L22.9775 30.3056C22.9045 30.5442 22.8979 30.7981 22.9583 31.0402C23.0187 31.2823 23.1438 31.5034 23.3202 31.6798C23.4966 31.8562 23.7177 31.9813 23.9598 32.0417C24.2019 32.1021 24.4558 32.0954 24.6944 32.0225L29.8704 30.4345C29.871 30.4345 29.8716 30.4345 29.8721 30.4345C30.3726 30.2805 30.8267 30.0063 31.197 29.636L40.0414 20.7916C41.1723 19.6616 41.4847 18.0088 41.0172 16.5753L41.6295 15.963C41.8944 15.7055 42.0753 15.3739 42.1486 15.0118C42.2219 14.6497 42.184 14.2739 42.04 13.9336C41.896 13.5934 41.6526 13.3046 41.3417 13.1051C41.0307 12.9055 40.6667 12.8046 40.2974 12.8155ZM36.9727 16.5287C37.2947 16.4841 37.6174 16.5458 37.8751 16.7203C37.9569 16.7757 38.0258 16.8376 38.0917 16.9011C38.1115 16.9213 38.1318 16.941 38.1526 16.9602C38.6709 17.5177 38.6273 18.3174 38.0971 18.8472L29.2527 27.6916C29.1995 27.7449 29.1344 27.7842 29.0629 27.8062L26.3666 28.6334L27.1938 25.9371C27.2158 25.8656 27.2551 25.8005 27.3083 25.7473L36.0793 16.9763C36.3307 16.725 36.6508 16.5734 36.9727 16.5287ZM16.0416 22.9167C15.2808 22.9167 14.6666 23.5309 14.6666 24.2917C14.6666 25.0526 15.2808 25.6667 16.0416 25.6667H22.4851L22.8163 24.5943C22.9997 23.9802 23.301 23.4117 23.7043 22.9167H16.0416ZM16.0416 29.3334C15.2808 29.3334 14.6666 29.9476 14.6666 30.7084C14.6666 31.4692 15.2808 32.0834 16.0416 32.0834H21.3948C21.0556 31.3684 20.9828 30.5441 21.2211 29.7649L21.359 29.3334H16.0416Z" fill="#2D2A4A" />
                    </svg>
                </div>
                <div class="info">
                    <div class="box-title">กำลังเปิดรับสมัคร
                        <?php if (get_field('generation')) {
                            echo 'รุ่นที่' . get_field('generation');
                        } ?></div>
                    <?php
                    if (get_field('admission_date')) {
                        echo '<div class="box-content">เปิดรับสมัคร ' . get_field('admission_date') . '</div>';
                    }
                    ?>
                </div>
            </div>
        </div>
        <div class="s-container s-grid -d2 items-center mb-0">
            <div class="director">
                <?php
                $director = get_field('director');
                if ($director) {
                    // override $post
                    $post = $director;
                    setup_postdata($post);
                    echo '<h3 class="s-title"><strong>ผู้อำนวยการ</strong>หลักสูตร</h3>';
                    echo '<div class="s-flex items-center">';
                    echo '<div class="director-img">';
                    the_post_thumbnail('thumbnail');
                    echo '</div>';
                    echo '<div class="director-info _h">';
                    echo '<h4 class="director-name">' . get_the_title() . '</h4>';
                    echo '<div class="director-position">' . get_field('rank') . '</div>';
                    echo '<p class="director-deparment">สถาบันบัณฑิตพัฒนบริหารศาสตร์</p>';
                    echo '</div>';
                    echo '</div>';
                    wp_reset_postdata();
                }
                ?>
            </div>
            <?php
            $director_video = get_field('director_video');
            $youtube_id = get_field('program_youtube_id');
            if ($youtube_id) {
                echo '<div class="program-video s-lg">';
                echo '<a data-src="//www.youtube.com/watch?v=' . $youtube_id . '&mute=false" data-poster="https://img.youtube.com/vi/' . $youtube_id . '/maxresdefault.jpg" data-lg-size="1280-720">';
                seed_icon('circled-play');
                echo '<img src="https://img.youtube.com/vi/' . $youtube_id . '/maxresdefault.jpg" alt="school Video Cover" />';
                echo '</a>';
                echo '</div>';
            } elseif ($director_video) {
                echo '<div class="program-video">';
                echo '<a href="' . $director_video . '" target="_blank">';
                seed_icon('circled-play');
                echo '<img src="' . get_field('director_video_cover') . '" alt="program_video_cover">';
                echo '</a>';
                echo '</div>';
            }
            ?>
        </div>
    </div>
    <div class="s-sec program-info alignfull">
        <div class="s-container s-grid -d2">
            <div class="program-title">
                <h3 class="s-title"><b>ความพิเศษ</b>ของหลักสูตร</h3>
                <div class="feature-list">
                    <?php
                    if (get_field('features')) {
                        echo get_field('features');
                    } else {
                        echo '';
                    }
                    ?>
                </div>
                <?php if (get_field('file_announce') || get_field('file_brochure')) : ?>
                    <div class="program-download">
                        <div class="s-flex items-center">
                            <h5 class="s-underline"><b>ดาวน์โหลด</b></h5>
                            <?php
                            if (get_field('file_announce')) {
                                echo '<a href="' . get_field('file_announce') . '" class="btn-outline s-flex items-center" download>';
                                seed_icon('file-announce');
                                echo 'ประกาศ';
                                echo '</a>';
                            }
                            if (get_field('file_brochure')) {
                                echo '<a href="' . get_field('file_brochure') . '" class="btn-outline s-flex items-center" download>';
                                seed_icon('file-brochure');
                                echo 'เอกสารแนะนำ';
                                echo '</a>';
                            }
                            ?>
                        </div>
                    </div>
                <?php endif; ?>
            </div>
            <div class="program-title">
                <h3 class="s-title"><b>วิชา</b>ในหลักสูตร</h3>
                <div id="major-list" class="major-list">
                    <?php
                    if (get_field('major')) {
                        echo get_field('major');
                    } else {
                        echo '';
                    }
                    ?>
                </div>
                <?php
                if (get_field('major_link')) {
                    echo '<a href="' . get_field('major_link') . '" class="s-flex">';
                    echo 'วิชาทั้งหมดในหลักสูตร';
                    seed_icon('arrow-bottom-circle');
                    echo '</a>';
                }
                ?>
            </div>
        </div>
    </div>
    <div class="s-sec program-admission alignfull">
        <div class="s-container">
            <h3 class="s-title"><b>สมัครเรียน</b>หลักสูตร</h3>
            <div class="s-grid -d2">
                <div class="col">
                    <div class="description">
                        <h4><b>ค่าลงทะเบียน</b></h4>
                        <p>
                            <?php
                            if (get_field('admission_fee_description')) {
                                echo get_field('admission_fee_description');
                            }
                            ?>
                        </p>
                        <?php
                        if (have_rows('admission_fee')) {
                            echo '<table class="table-admission-fee">';
                            while (have_rows('admission_fee')) : the_row();
                                $item = get_sub_field('item');
                                $type = get_sub_field('type');
                                $fee = get_sub_field('fee');
                                echo '<tr>';
                                echo '<td>' . $item . '</td>';
                                echo '<td>' . $type . '</td>';
                                echo '<td class="text-right">';
                                if ($fee) {
                                    echo $fee;
                                }
                                echo '</td>';
                                echo '</tr>';
                            endwhile;
                            if (get_field('program_fee')) {
                                echo '<tr><td><b>ประมาณค่าใช้จ่ายตลอดหลักสูตร</b></td><td></td><td class="text-right"><b>' . number_format(get_field('program_fee')) . '</b></td></tr>';
                            }
                            echo '</table>';
                        } else {
                            lorem_table();
                        }
                        ?>
                    </div>
                </div>
                <div class="col">
                    <?php if (get_field('qualifications')) : ?>
                        <div class="qualifications">
                            <h4><b>คุณสมบัติผู้สมัคร</b></h4>
                            <?php
                            if (get_field('qualifications')) {
                                echo get_field('qualifications');
                            } else {
                                echo '';
                            }

                            ?>
                        </div>
                    <?php endif; ?>
                    <?php

                    if (get_field('admission_date')) {
                        echo '<h4><b>สมัครเรียน</b></h4>';
                        echo '<p>เปิดรับสมัคร ' . get_field('admission_date');
                    } else {
                        
                    }

                    

                    ?>
                    <div class="_space"></div>
                    <h4><b>ติดต่อข้อมูลหลักสูตร</b></h4>
                    <?php
	            	if(have_rows('contact_list')){ ?>
                        <div class="school-contact" style="padding: 0;">
                            <ul class="contact-list">
                                <?php

                                function get_type_url($contact_type, $contact_value)
                                {
                                    switch($contact_type) {
                                        case 'email':
                                            return 'mailto:' . $contact_value;
                                        case 'phone':
                                            return 'tel:' . $contact_value;
                                        case 'fax':
                                            return  'tel:' .$contact_value;
                                        default:
                                            return $contact_value;
                                    }
                                }
                                while(have_rows('contact_list', $term)): the_row();
                                    $contact_type = get_sub_field('type');
                                    $contact_text = get_sub_field('text');
                                    $contact_value = get_sub_field('value');
                                ?>
                                <li>
                                    <a href="<?php echo get_type_url($contact_type, $contact_value); ?>"
									target="_blank" class="s-flex">
                                        <?php seed_icon('n-'. $contact_type); ?>
                                        <?php echo $contact_text;?>
                                    </a>
                                </li>
                                <?php endwhile; ?>
                            </ul>
                        </div>
					<?php }else{ ?>
                       
                    <?php } ?>
                </div>
            </div>
        </div>
    </div>


    <?php
    if (have_posts()) {
        while (have_posts()) {
            the_post();
            edit_post_link('EDIT', '', '', null, 'btn-edit');
        }
    }
    ?>
</main>

<?php
get_footer();
?>